Q.No-01    List any five functions of the pandas library with execution.

Ans :-

Here are some of the main functions of the Pandas library:

**`Data Structures :-`**
   - Series: A one-dimensional labeled array capable of holding any data type.
   - DataFrame: A two-dimensional labeled data structure, similar to a spreadsheet or SQL table, with rows and columns.

`Series()`

In [5]:
import pandas as pd

# Creating a pandas Series representing the population of three cities
population_data = {
    'City A': 1000000,
    'City B': 750000,
    'City C': 500000
}

population_series = pd.Series(population_data)

population_series

City A    1000000
City B     750000
City C     500000
dtype: int64

`DataFrame()`

In [6]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie','Ankit Fadia'],
        'Age': [25, 30, 35, None ],
        'City': ['New York', 'San Francisco', 'Los Angeles','India']}
df = pd.DataFrame(data)
df

          Name   Age           City
0        Alice  25.0       New York
1          Bob  30.0  San Francisco
2      Charlie  35.0    Los Angeles
3  Ankit Fadia   NaN          India

**`Data Writing :-`**
   - Writing data: Pandas allows you to write data to various file formats.

`to_csv()`    And    `to_excel()`

In [7]:
# Writing DataFrame to a CSV file
csv_file_path = 'example_data_csv.csv'
df.to_csv(csv_file_path, index=False)

# Writing DataFrame to an Excel file
excel_file_path = 'example_data_excel.xlsx'
df.to_excel(excel_file_path, index=False)

**`Data Manipulation :-`**
   - Reshaping: Pivoting, melting, and stacking data to transform its structure.

`pivot()`

In [22]:
import pandas as pd

data = {
    'Date': ['2023-07-01', '2023-07-02', '2023-07-01', '2023-07-02'],
    'City': ['New York', 'New York', 'Los Angeles', 'Los Angeles'],
    'Temperature': [78, 82, 90, 88],
    'Humidity': [60, 55, 45, 50]
}

Reshape_df = pd.DataFrame(data)
Reshape_df

         Date         City  Temperature  Humidity
0  2023-07-01     New York           78        60
1  2023-07-02     New York           82        55
2  2023-07-01  Los Angeles           90        45
3  2023-07-02  Los Angeles           88        50

In [23]:
pivoted_df = Reshape_df.pivot(index='Date', columns='City', values=['Temperature'])
pivoted_df

           Temperature
City       Los Angeles New York
Date
2023-07-01          90       78
2023-07-02          88       82

In [24]:
pivoted_df2 = Reshape_df.pivot(index='Date', columns='City', values=['Humidity'])
pivoted_df2

              Humidity
City       Los Angeles New York
Date
2023-07-01          45       60
2023-07-02          50       55

**`Data Cleaning :-`**
   - Handling Missing Data: Identifying and dealing with missing values in the dataset.

`dropna()`

In [25]:
import pandas as pd

# Create a DataFrame with missing data
data = {'A': [1, 2, None, 4, 5],
        'B': [None, 6, 7, 8, 9],
        'C': [10, 11, 12, None, 14]}
Drop_df = pd.DataFrame(data)
Drop_df

     A    B     C
0  1.0  NaN  10.0
1  2.0  6.0  11.0
2  NaN  7.0  12.0
3  4.0  8.0   NaN
4  5.0  9.0  14.0

In [27]:
# Drop rows with any missing values
df_drop_rows = Drop_df.dropna()

df_drop_rows

     A    B     C
1  2.0  6.0  11.0
4  5.0  9.0  14.0

In [28]:
# Drop columns with any missing values
df_drop_cols = Drop_df.dropna(axis=1)

df_drop_cols

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

--------------------------------------------------------------------------------------------------------------------

Q.No-02    Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

Ans :-

In [29]:
import pandas as pd

# Sample DataFrame
data = {
    'A': [10, 20, 30, 40],
    'B': [50, 60, 70, 80],
    'C': [90, 100, 110, 120]
}

Reindex_df = pd.DataFrame(data)

Reindex_df

    A   B    C
0  10  50   90
1  20  60  100
2  30  70  110
3  40  80  120

In [38]:
new_df = Reindex_df.copy()
new_df.reset_index(drop=True, inplace=True)

    # Re-index the new DataFrame with the new index starting from 1 and incrementing by 2
new_df.index = pd.RangeIndex(start=1, step=2, stop=len(new_df)*2)

new_df

    A   B    C
1  10  50   90
3  20  60  100
5  30  70  110
7  40  80  120

--------------------------------------------------------------------------------------------------------------------

Q.No-03    You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

Ans :-

In [62]:
Data = {
    'Values': [10,20,30,40,50]
}

import pandas as pd

Value_df = pd.DataFrame(Data)

Value_df

   Values
0      10
1      20
2      30
3      40
4      50

**`As Per Question :-`**
   - Define a Function to Calculate the Sum of the first three Values of the Dataframe

In [70]:
def calculate_sum_of_first_three(Value_df):
    if 'Values' not in Value_df.columns:
        print("Error: 'Values' column not found in the DataFrame.")
        return

    values_column = Value_df['Values']

    if len(values_column) < 3:
        print("Error: There are not enough values in the 'Values' column to calculate the sum.")
        return

    sum_first_three = sum(values_column[:3])
    print("Sum of the first three values in the 'Values' column:", sum_first_three)

calculate_sum_of_first_three(Value_df)

Sum of the first three values in the 'Values' column: 60

--------------------------------------------------------------------------------------------------------------------

Q.No-04    Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

Ans :-

In [99]:
import pandas as pd

# Sample data for the 'Text' column
text_data = ['Full Name of NASA',
             'National Aeronautics and Space Administration',
             'Full Name of ISRO.',
             'Indian Space Research Organisation',
             'Full Name of CNSA',
             'Chaina National Space Administration',
             'Full Name of RFSA',
             'Russian Federal Space Agency',
             'Full Name of ESA',
             'European Space Agency',]

# Creating the DataFrame with the 'Text' column and an index
Full_Name_df = pd.DataFrame({'Text': text_data})

# Adding index to the DataFrame
Full_Name_df.index = ['Q.No-01', 'Ans :-','Q.No-02', 'Ans :-','Q.No-03', 'Ans :-','Q.No-04', 'Ans :-','Q.No-05','Ans :-']

Full_Name_df

                                                  Text
Q.No-01                              Full Name of NASA
Ans :-   National Aeronautics and Space Administration
Q.No-02                             Full Name of ISRO.
Ans :-              Indian Space Research Organisation
Q.No-03                              Full Name of CNSA
Ans :-            Chaina National Space Administration
Q.No-04                              Full Name of RFSA
Ans :-                    Russian Federal Space Agency
Q.No-05                               Full Name of ESA
Ans :-                           European Space Agency

**`As Per Question :-`**
   - Define a Function to Create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [100]:
def count_words_in_text(Full_Name_df):
    # Split each row in the 'Text' column into a list of words using whitespace as a delimiter
    Full_Name_df['Word_Count'] = Full_Name_df['Text'].apply(lambda x: len(str(x).split()))
    return Full_Name_df

count_words_in_text(Full_Name_df)

                                                  Text  Word_Count
Q.No-01                              Full Name of NASA           4
Ans :-   National Aeronautics and Space Administration           5
Q.No-02                             Full Name of ISRO.           4
Ans :-              Indian Space Research Organisation           4
Q.No-03                              Full Name of CNSA           4
Ans :-            Chaina National Space Administration           4
Q.No-04                              Full Name of RFSA           4
Ans :-                    Russian Federal Space Agency           4
Q.No-05                               Full Name of ESA           4
Ans :-                           European Space Agency           3

--------------------------------------------------------------------------------------------------------------------

Q.No-05    How are DataFrame.size() and DataFrame.shape() different?

Ans :-

In [104]:
import pandas as pd

# Sample data for the DataFrame
data = {
    'Name': ['John', 'Alice', 'Bob','Abhi'],
    'Age': [28, 24, 22, 18],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Delhi']
}

# Create a DataFrame
Size_Shape_df = pd.DataFrame(data)

Size_Shape_df

    Name  Age         City
0   John   28     New York
1  Alice   24  Los Angeles
2    Bob   22      Chicago
3   Abhi   18        Delhi

In the context of pandas, a popular data manipulation library in Python, `DataFrame.size` and `DataFrame.shape` are two different attributes used to retrieve information about the dimensions of a DataFrame.

1. `DataFrame.size`:
   - The `DataFrame.size` attribute returns the total number of elements in the DataFrame, which is calculated by multiplying the number of rows by the number of columns. 
   - In other words, it gives you the total count of cells in the DataFrame, including both empty and non-empty cells.
   - The value returned by `DataFrame.size` is an integer.

In [105]:
# Get the total number of elements in the DataFrame
total_elements = Size_Shape_df.size

print("Total number of elements in the DataFrame:", total_elements)

Total number of elements in the DataFrame: 12

2. `DataFrame.shape`:
   - The `DataFrame.shape` attribute returns a tuple representing the dimensions of the DataFrame.
   - The tuple contains two elements: the first element is the number of rows, and the second element is the number of columns in the DataFrame.
   - The value returned by `DataFrame.shape` is a tuple of integers.

In [106]:
# Get the dimensions of the DataFrame (number of rows and columns)
num_rows, num_columns = Size_Shape_df.shape

print("Number of rows in the DataFrame:", num_rows)
print("Number of columns in the DataFrame:", num_columns)

Number of rows in the DataFrame: 4
Number of columns in the DataFrame: 3

--------------------------------------------------------------------------------------------------------------------

Q.No-06    Which function of pandas do we use to read an excel file?

Ans :-

To read an Excel file using pandas, you can use the `pandas.read_excel()` function.

In [108]:

import pandas as pd

# Replace 'file_path.xlsx' with the actual path to your Excel file
EXCEL_df = pd.read_excel('example_data_excel.xlsx')

EXCEL_df

          Name   Age           City
0        Alice  25.0       New York
1          Bob  30.0  San Francisco
2      Charlie  35.0    Los Angeles
3  Ankit Fadia   NaN          India

--------------------------------------------------------------------------------------------------------------------

Q.No-07    You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

Ans :-

In [6]:
Email_data = {
    'Email': ['Rishika101@gmail.com', 'Abhi102@gmail.com', 'Kundan103@gmail.com']
    }

import pandas as pd

Email_df = pd.DataFrame(Email_data)

Email_df

                  Email
0  Rishika101@gmail.com
1     Abhi102@gmail.com
2   Kundan103@gmail.com

**`As Per Question :-`**
   - Define a Function to Creates a new column 'Username' in df that contains only the username part of each email address.

In [7]:
def extract_username(Email_df):
    Email_df['Username'] = Email_df['Email'].str.split('@').str[0]
    return Email_df

extract_username(Email_df)

                  Email    Username
0  Rishika101@gmail.com  Rishika101
1     Abhi102@gmail.com     Abhi102
2   Kundan103@gmail.com   Kundan103

--------------------------------------------------------------------------------------------------------------------

Q.No-08   You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

```
   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2
```

Your function should select the following rows:

```
   A   B   C

1  8   2   7

4  9   1   2
```

The function should return a new DataFrame that contains only the selected rows.

Ans :-

In [9]:
import pandas as pd

# Example usage with the given DataFrame
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

ABC_df = pd.DataFrame(data)

ABC_df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

**`As Per Question :-`**
   - Define a Function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [10]:
def filter_dataframe(ABC_df):
    selected_rows = ABC_df[(ABC_df['A'] > 5) & (ABC_df['B'] < 10)]
    return selected_rows

filter_dataframe(ABC_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

--------------------------------------------------------------------------------------------------------------------

Q.No-09    Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

Ans :-

In [11]:
import pandas as pd

# Sample data for the 'Values' column
values_data = [10, 20, 30, 40, 50]

# Create the DataFrame with the 'Values' column
values_data_df = pd.DataFrame({'Values': values_data})

# Display the DataFrame
values_data_df

   Values
0      10
1      20
2      30
3      40
4      50

**`As Per Question :-`**
   - Define a Function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [17]:
def calculate_stats(values_data_df):
    # Check if the DataFrame is not empty and contains the 'Values' column
    if values_data_df.empty or 'Values' not in values_data_df.columns:
        raise ValueError("DataFrame is empty or doesn't contain 'Values' column.")
    
    # Calculate the mean, median, and standard deviation
    mean_value = values_data_df['Values'].mean()
    median_value = values_data_df['Values'].median()
    std_value = values_data_df['Values'].std()
    
    # Return the calculated statistics as a dictionary
    return {
        'mean': mean_value,
        'median': median_value,
        'standard_deviation': std_value
    }

Stats = calculate_stats(values_data_df)

print("Mean of the values in the 'Values' column :- ",Stats['mean'],"\n")

print("Median of the values in the 'Values' column :- ",Stats['median'],"\n")

print("Standard deviation of the values in the 'Values' column :- ",Stats['standard_deviation'])

Mean of the values in the 'Values' column :-  30.0

Median of the values in the 'Values' column :-  30.0

Standard deviation of the values in the 'Values' column :-  15.811388300841896

--------------------------------------------------------------------------------------------------------------------

Q.No10    Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

Ans :-

In [26]:
import pandas as pd

# Sample data for the 'Sales' and 'Date' columns
sales_data = [100, 150, 200, 120, 180, 300, 400]
date_data = ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05', '2023-07-06', '2023-07-07']

# Create the DataFrame
data = {'Sales': sales_data, 'Date': date_data}
Shop_df = pd.DataFrame(data)

# Display the DataFrame
Shop_df

   Sales        Date
0    100  2023-07-01
1    150  2023-07-02
2    200  2023-07-03
3    120  2023-07-04
4    180  2023-07-05
5    300  2023-07-06
6    400  2023-07-07

**`As Per Question :-`**
   - Define a Function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [27]:
def add_moving_average(Shop_df):
    # Sort the DataFrame by date to ensure the rolling window works correctly
    Shop_df.sort_values(by='Date', inplace=True)
    
    # Calculate the moving average using a rolling window of size 7 and including the current day
    Shop_df['MovingAverage'] = Shop_df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return Shop_df

add_moving_average(Shop_df)

   Sales        Date  MovingAverage
0    100  2023-07-01     100.000000
1    150  2023-07-02     125.000000
2    200  2023-07-03     150.000000
3    120  2023-07-04     142.500000
4    180  2023-07-05     150.000000
5    300  2023-07-06     175.000000
6    400  2023-07-07     207.142857

-------------------------------------------------------------------------------------------------------------------

Q.No-11    You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
```
         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05
```
Your function should create the following DataFrame:
```
         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday
```
The function should return the modified DataFrame.

Ans :-

In [31]:
import pandas as pd

# Example usage:
data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']
}

Weekday_df = pd.DataFrame(data)

Weekday_df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [30]:
def add_weekday_column(Weekday_df):
    # Convert the 'Date' column to datetime format
    Weekday_df['Date'] = pd.to_datetime(Weekday_df['Date'])

    # Extract the weekday name and create the 'Weekday' column
    Weekday_df['Weekday'] = Weekday_df['Date'].dt.strftime('%A')

    return Weekday_df

add_weekday_column(Weekday_df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

--------------------------------------------------------------------------------------------------------------------

Q.No-12    Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

Ans :-

In [46]:
import pandas as pd

# Create a list of timestamps
timestamps = pd.date_range(start='2023-01-01', end='2023-02-28', freq='D')

# Create a DataFrame with one column named 'Date'
DateTime_df = pd.DataFrame({"Date": timestamps})

# Print the DataFrame
DateTime_df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05
36 2023-02-06
37 2023-02-07
38 2023-02-08
39 2023-02-09
40 2023-02-10
41 2023-02-11
42 2023-02-12
43 2023-02-13
44 2023-02-14
45 2023-02-15
46 2023-02-16
47 2023-02-17
48 2023-02-18
49 2023-02-19
50 2023-02-20
51 2023-02-21
52 2023-02-22
53 2023-02-23
54 2023-02-24
55 2023-02-25
56 2023-02-26
57 2023-02-27
58 2023-02-28

In [47]:
# Function to select rows where the date is between '2023-01-01' and '2023-01-31'
def select_rows_between_dates(DateTime_df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (DateTime_df['Date'] >= start_date) & (DateTime_df['Date'] <= end_date)
    selected_rows = DateTime_df.loc[mask]
    return selected_rows

# Call the function to get the selected rows
select_rows_between_dates(DateTime_df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

--------------------------------------------------------------------------------------------------------------------

Q.No13    To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans :-

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is the `pandas` library itself.

In [48]:
import pandas as pd

                                        END